---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetMarkersAndTextSettings(Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings)
source: html/4e164aee-d8cb-2201-8a6a-52837cc6342e.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.SetMarkersAndTextSettings Method

Set markers and text settings object for the style.

## Syntax (C#)
```csharp
public void SetMarkersAndTextSettings(
	AnalysisDisplayMarkersAndTextSettings markersAndTextSettings
)
```

## Parameters
- **markersAndTextSettings** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - markers and text settings were not created with the object.